### Pandas
- 데이터 분석을 위한 사용이 쉽고 성능이 좋은 오픈소스 python 라이브러리
- R과 pandas의 특징
    - R보다 pandas 가 학습이 쉽다.
    - R보다 pandas가 성능이 좋다.
    - R보다 Python은 활용할수 있는 분야가 많다
- 크게 두가지 데이터 타입을 사용합니다.
    - Series : index와 value로 이루어진 데이터 타입
    - DataFrame : index, colume, value로 이루어진 데이터 타입

### 1.Series
- 동일한 데이터 타입의 값을 갖습니다.

In [1]:
# Series value 만 설정하면  index는 0부터 자동으로 설정
data = pd.Series(np.random.randint(10,size= 5))
data

0    7
1    3
2    8
3    7
4    3
dtype: int32

In [3]:
#index 설정
data = pd.Series(np.random.randint(10,size=5),index = list("ABCDE"))
data

A    5
B    1
C    0
D    3
E    6
dtype: int32

In [4]:
data.index,data.values

(Index(['A', 'B', 'C', 'D', 'E'], dtype='object'), array([5, 1, 0, 3, 6]))

In [5]:
data["B"],data.B

(1, 1)

In [8]:
data["C"]=10
data

A     5
B     1
C    10
D     3
E     6
dtype: int32

In [10]:
#브로드 캐스팅
data *10

A     50
B     10
C    100
D     30
E     60
dtype: int32

In [12]:
data[["B","E"]]

B    1
E    6
dtype: int32

In [13]:
#offset index
data[2::2]

C    10
E     6
dtype: int32

In [14]:
data[::-1]

E     6
D     3
C    10
B     1
A     5
dtype: int32

In [16]:
data2 = pd.Series({"D":3,"E":5,"F":7})
data2

D    3
E    5
F    7
dtype: int64

In [17]:
result = data +data2
result

A     NaN
B     NaN
C     NaN
D     6.0
E    11.0
F     NaN
dtype: float64

In [20]:
result[result.isnull()]=data
result[result.isnull()]=data2
result

A     5.0
B     1.0
C    10.0
D     6.0
E    11.0
F     7.0
dtype: float64

### 2.DataFrame
- 데이터 프레임은 여러개의 Series로 구성
- 같은 컬럼에 있는 value값은 같은 데이터 타입을 갖습니다.

In [21]:
# 데이터 프레임 생성 1: 딕셔너리의 리스트

In [22]:
datas= {
    "name":["dss","fcamp"],
    "email":["dss@gmail.com","fcamp@daum.net"],
}
datas

{'name': ['dss', 'fcamp'], 'email': ['dss@gmail.com', 'fcamp@daum.net']}

In [23]:
df = pd.DataFrame(datas)

In [24]:
df

    name           email
0    dss   dss@gmail.com
1  fcamp  fcamp@daum.net

In [25]:
# 데이터 프레임 생성 2: 리스트의 딕셔너리

In [28]:
datas= [ {"name":"dss","email":"dss@gmail.com"},
    {"name":"fcamp","email":"fcamp@daum.net"},]
datas

[{'name': 'dss', 'email': 'dss@gmail.com'},
 {'name': 'fcamp', 'email': 'fcamp@daum.net'}]

In [30]:
df = pd.DataFrame(datas,index=["one","two"])
df

      name           email
one    dss   dss@gmail.com
two  fcamp  fcamp@daum.net

In [31]:
df.index

Index(['one', 'two'], dtype='object')

In [32]:
df.columns

Index(['name', 'email'], dtype='object')

In [33]:
df.values

array([['dss', 'dss@gmail.com'],
       ['fcamp', 'fcamp@daum.net']], dtype=object)

In [35]:
#데이터 프레임에서 데이터의 선택 : row,colunm,(row,cloumn)

In [36]:
#row 선택
datas= [ {"name":"dss","email":"dss@gmail.com"},
    {"name":"fcamp","email":"fcamp@daum.net"},]
df = pd.DataFrame(datas)
df

    name           email
0    dss   dss@gmail.com
1  fcamp  fcamp@daum.net

In [38]:
df.loc[1]["email"]

'fcamp@daum.net'

In [39]:
#index가 있으면 수정 없으면 추가
df.loc[2] = {"name":"andy","email":"andy@naver.com"}
df

    name           email
0    dss   dss@gmail.com
1  fcamp  fcamp@daum.net
2   andy  andy@naver.com

In [40]:
#column 선택
df["name"]

0      dss
1    fcamp
2     andy
Name: name, dtype: object

In [41]:
df["id"] = ""

In [42]:
df

    name           email id
0    dss   dss@gmail.com
1  fcamp  fcamp@daum.net
2   andy  andy@naver.com

In [44]:
df["id"] = range(1,4) #np.arange(1,4)
df

    name           email  id
0    dss   dss@gmail.com   1
1  fcamp  fcamp@daum.net   2
2   andy  andy@naver.com   3

In [45]:
#row,colume 선택
df.loc[[0,2],["email","id"]]

            email  id
0   dss@gmail.com   1
2  andy@naver.com   3

In [46]:
#컬럼 데이터 순서 설정
df[["id","name","email"]]

   id   name           email
0   1    dss   dss@gmail.com
1   2  fcamp  fcamp@daum.net
2   3   andy  andy@naver.com

In [47]:
#head,tail
df.head(2)

    name           email  id
0    dss   dss@gmail.com   1
1  fcamp  fcamp@daum.net   2

In [48]:
DF.TAIL(2)

NameError: name 'DF' is not defined

In [49]:
df.tail(2)

    name           email  id
1  fcamp  fcamp@daum.net   2
2   andy  andy@naver.com   3

### 3.apply 함수
- map 함수와 비슷

In [51]:
#email 컬럼에서 메일의 도메인만 가져와서 새로운 domail 컬럼을 생성
df

    name           email  id
0    dss   dss@gmail.com   1
1  fcamp  fcamp@daum.net   2
2   andy  andy@naver.com   3

In [57]:
def domain(email):
    return email.split("@")[1].split(".")[0]

domain(df.loc[0]["email"])

'gmail'

In [59]:
df["domain"] = df["email"].apply(domain)
df

    name           email  id domain
0    dss   dss@gmail.com   1  gmail
1  fcamp  fcamp@daum.net   2   daum
2   andy  andy@naver.com   3  naver

In [60]:
from makedata import *

In [62]:
get_name()

'Andrew'

In [63]:
get_age()

40

In [77]:
df1 = pd.DataFrame(make_data(5))
df2 = pd.DataFrame(make_data(5))

### 4. append

In [78]:
df3 = df1.append(df2)
df3[2:7]

   Age     Name
2   26     Adam
3   35   Anchal
4   27  Anthony
0   36      Jin
1   22    Billy

In [83]:
#reset_index 인덱스 재정렬
df3.reset_index(drop=True,inplace=True)
df3.tail(2)

   Age    Name
8   31    Adam
9   40  Andrew

In [82]:
df3=df1.append(df2,ignore_index=True)
df3.tail(2)

   Age    Name
8   31    Adam
9   40  Andrew

### 5. concat
- row 나 column으로 데이터 프레임을 합칠때 사용

In [85]:
df3=pd.concat([df1,df2]).reset_index(drop=True)

In [86]:
df3

   Age     Name
0   33   Anchal
1   25  Anthony
2   26     Adam
3   35   Anchal
4   27  Anthony
5   36      Jin
6   22    Billy
7   38    Billy
8   31     Adam
9   40   Andrew

In [87]:
pd.concat([df3,df1],axis=1)

   Age     Name   Age     Name
0   33   Anchal  33.0   Anchal
1   25  Anthony  25.0  Anthony
2   26     Adam  26.0     Adam
3   35   Anchal  35.0   Anchal
4   27  Anthony  27.0  Anthony
5   36      Jin   NaN      NaN
6   22    Billy   NaN      NaN
7   38    Billy   NaN      NaN
8   31     Adam   NaN      NaN
9   40   Andrew   NaN      NaN

In [88]:
pd.concat([df3,df1],axis=1,join="inner")

   Age     Name  Age     Name
0   33   Anchal   33   Anchal
1   25  Anthony   25  Anthony
2   26     Adam   26     Adam
3   35   Anchal   35   Anchal
4   27  Anthony   27  Anthony

In [89]:
df=pd.DataFrame(make_data())
df

   Age     Name
0   25  Anthony
1   21    Billy
2   27    Billy
3   28     Alan
4   27  Anthony
5   26  Anthony
6   33     Alex
7   35   Anchal
8   29   Andrew
9   31   Andrew

In [94]:
#size
result_df = df.groupby("Name").size().reset_index(name="count")
result_df

      Name  count
0     Alan      1
1     Alex      1
2   Anchal      1
3   Andrew      2
4  Anthony      3
5    Billy      2

In [96]:
#sort_values : 설정한 컬럼으로 데이터 프레임을 정렬
result_df.sort_values(["count","Name"],ascending=False, inplace=True)
result_df.reset_index(drop=True,inplace=True)
result_df

      Name  count
0  Anthony      3
1    Billy      2
2   Andrew      2
3   Anchal      1
4     Alex      1
5     Alan      1

In [97]:
#agg
#size(),max(),min()meam()

In [98]:
df.groupby("Name").agg("min").reset_index()

      Name  Age
0     Alan   28
1     Alex   33
2   Anchal   35
3   Andrew   29
4  Anthony   25
5    Billy   21

In [99]:
#데이터르 요약해서 보여주는 함수
df.describe()

             Age
count  10.000000
mean   28.200000
std     4.049691
min    21.000000
25%    26.250000
50%    27.500000
75%    30.500000
max    35.000000

### summary
- pandas
    - 데이터 분선 : 데이터 전처리 파트
    - 테이블 형태의 데이터를 처리할때 사용하는 python 라이브러리
    - Series, DataFrame
    - Series
        - 생성, 선택, 수정 방법
    - DataFrame
        - 생성 방법 1: 딕셔너리의 리스트 : 리스트 -> 컬럼 데이터
        - 생성 방법 2 : 리스트이 딕셔너리 : 딕셔너리 -> 로우 데이터
        - row 선택 : `df.loc[idx]`
        - column 선택 : `df[column name]`
        - row, cloumn 선택 : `df.loc[idx, column]`
        - 함수
            - apply, append, concat
            - groupby, merge

In [1]:
import makedata

In [3]:
makedata.get_age(),makedata.get_name()

(35, 'Anthony')

#### quiz
- makedata 모듈을 이용해서 데이터 프레임 만들기
- user_df
    - 8명의 테이터가 있는 데이터 프레임
    - UserID : 1~8
    - Name : makedata.get_name()
    - Age : makedata.get_age()
    - 중복되는 Name 값 없이

In [63]:
datas = {}
datas["UserID"] = list(range(1,9))
datas["Age"] = [makedata.get_age() for _ in range(8)] # _ : 사용하지 않는 변수
names = []
while True:
    
    name = makedata.get_name()
    if name not in names:
        names.append(name)
    
    if len(names) >= 8:
        break;
        
datas["Name"] = names

user_df = pd.DataFrame(datas)
user_df

   UserID  Age     Name
0       1   39   Arnold
1       2   22     Alex
2       3   24    Alvin
3       4   26    Billy
4       5   38  Anthony
5       6   28   Anchal
6       7   24     Adam
7       8   24   Andrew

#### quiz
    - money_df 만들기
        - 15개의 데이터
        - ID :1 ~ 8 랜덤한 숫자 데이터
        - Money : 1000원 단위로 1000 ~20000 원까지의 숫자가 저장

In [64]:
money_df = pd.DataFrame(columns=["ID","Money"])

for _ in range(15):
    money_df.loc[len(money_df)] = {
        "ID" : np.random.randint(1,9),
        "Money" : np.random.randint (1,21) *1000,
    }

ids = money_df["ID"].unique()
ids.sort()
ids

array([2, 3, 4, 5, 6, 8], dtype=object)

### 7.Merge = sql(join)
- 두개 이상의 데이터 프레임을 합쳐서 결과를 출력하는 방법

In [65]:
money_df

   ID  Money
0   3   7000
1   2   7000
2   4  12000
3   8  10000
4   4  14000
5   6   5000
6   3   2000
7   6   9000
8   2  12000
9   8  11000
10  6  15000
11  5   7000
12  3  12000
13  6   1000
14  8  20000

In [66]:
user_df

   UserID  Age     Name
0       1   39   Arnold
1       2   22     Alex
2       3   24    Alvin
3       4   26    Billy
4       5   38  Anthony
5       6   28   Anchal
6       7   24     Adam
7       8   24   Andrew

In [67]:
user_df.merge(money_df,left_on="UserID",right_on="ID")

   UserID  Age     Name ID  Money
0       2   22     Alex  2   7000
1       2   22     Alex  2  12000
2       3   24    Alvin  3   7000
3       3   24    Alvin  3   2000
4       3   24    Alvin  3  12000
5       4   26    Billy  4  12000
6       4   26    Billy  4  14000
7       5   38  Anthony  5   7000
8       6   28   Anchal  6   5000
9       6   28   Anchal  6   9000
10      6   28   Anchal  6  15000
11      6   28   Anchal  6   1000
12      8   24   Andrew  8  10000
13      8   24   Andrew  8  11000
14      8   24   Andrew  8  20000

In [68]:
# 컬럼명 변경
user_df.rename(columns={"UserID":"ID"},inplace=True)
user_df.tail(1)

   ID  Age    Name
7   8   24  Andrew

In [69]:
user_df.merge(money_df).tail(2)

   ID  Age    Name  Money
13  8   24  Andrew  11000
14  8   24  Andrew  20000

In [70]:
result_df=pd.merge(money_df,user_df)
result_df.tail()

   ID  Money  Age     Name
10  6   5000   28   Anchal
11  6   9000   28   Anchal
12  6  15000   28   Anchal
13  6   1000   28   Anchal
14  5   7000   38  Anthony

In [77]:
#groupby sum, size, min .. 함수
money_list = result_df.groupby("Name").sum()["Money"].reset_index()
money_list

KeyError: 'Money'

In [76]:
#groupby : agg("sum"), agg("mean") .. : DataFrame
money_list = result_df.groupby("Name").agg("sum").reset_index()[["Name","Money"]]
money_list

KeyError: "['Money'] not in index"

In [75]:
result = pd.merge(user_df,money_list, how="outer")
result

     ID  Age     Name
0   1.0   39   Arnold
1   2.0   22     Alex
2   3.0   24    Alvin
3   4.0   26    Billy
4   5.0   38  Anthony
5   6.0   28   Anchal
6   7.0   24     Adam
7   8.0   24   Andrew
8   NaN   44     Alex
9   NaN   72    Alvin
10  NaN  112   Anchal
11  NaN   72   Andrew
12  NaN   52    Billy

In [ ]:
#fillna : NaN 을 특정 데이터로 채워줌

In [78]:
result.fillna(value=0, inplace=True)
result

     ID  Age     Name
0   1.0   39   Arnold
1   2.0   22     Alex
2   3.0   24    Alvin
3   4.0   26    Billy
4   5.0   38  Anthony
5   6.0   28   Anchal
6   7.0   24     Adam
7   8.0   24   Andrew
8   0.0   44     Alex
9   0.0   72    Alvin
10  0.0  112   Anchal
11  0.0   72   Andrew
12  0.0   52    Billy

In [79]:
result.dtypes

ID      float64
Age       int64
Name     object
dtype: object

In [81]:
result["ID"]= result["ID"].astype("int")
result

    ID  Age     Name
0    1   39   Arnold
1    2   22     Alex
2    3   24    Alvin
3    4   26    Billy
4    5   38  Anthony
5    6   28   Anchal
6    7   24     Adam
7    8   24   Andrew
8    0   44     Alex
9    0   72    Alvin
10   0  112   Anchal
11   0   72   Andrew
12   0   52    Billy

In [82]:
# result.sort_values("Money",ascending=False)  
# result [:3]  
# np.average(result.sort_values("Money",ascending=False)[:3]["Age"])

### Pandas Pivot
- 데이터 프레임의 컬럼 데이터에서 index, column, value를 선택해서 데이터 프레임을 만드는 방법
- `df.pivot(index,columns,values`
    - groupby 하고 pivot을 실행
- `df.pivot_table(values, index, columns, aggfunc)`


paindis io
- 데이터 프레임을 저장,로드

In [83]:
#load
titanic = pd.read_csv("datas/train.csv")
titanic.tail(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [84]:
#save
titanic.to_csv("datas/titanic.tsv",sep="\t",index =False)

In [85]:
#load : encoding
df= pd.read_csv("datas/2014_p.csv",encoding="euc_kr")

In [86]:
df.tail(2)

,ID,RCTRCK,RACE_DE,RACE_NO,PARTCPT_NO,RANK,RCHOSE_NM,HRSMN,RCORD,ARVL_DFFRNC,EACH_SCTN_PASAGE_RANK,A_WIN_SYTM_EXPECT_ALOT,WIN_STA_EXPECT_ALOT
27216,27217,제주,2014-11-29,9,7,6.0,미주여행,김경휴,0:01:31.1,13,2 - - - 2 - 3 - 6,6.2,9.4
27217,27218,제주,2014-11-29,9,6,1.0,철옹성,장우성,0:01:26.6,NaN,1 - - - 1 - 1 - 1,3.9,2.9

### kaggle
- 데이터 분선, 모델을 경쟁할수 있도록 만든 서비스
- https://www.kaggle.com

1. 성별, 좌석등급에 따른 데이터의 수

In [92]:
df1 = titanic.groupby(["Sex","Pclass"]).size().reset_index(name="Counts")
df1

      Sex  Pclass  Counts
0  female       1      94
1  female       2      76
2  female       3     144
3    male       1     122
4    male       2     108
5    male       3     347

In [94]:
#pivot
result = df1.pivot("Sex","Pclass","Counts")
result

Pclass    1    2    3
Sex
female   94   76  144
male    122  108  347

In [95]:
#pivot table 이용
titanic["counts"] = 1
titanic.tail(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,counts
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C,1
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,1

In [100]:
result = titanic.pivot_table("counts",["Pclass"],["Survived"],aggfunc=np.sum)
result

Survived    0    1
Pclass
1          80  136
2          97   87
3         372  119

In [102]:
result["total"]= result[0]+result[1]
result

Survived    0    1  total
Pclass
1          80  136    216
2          97   87    184
3         372  119    491

In [104]:
result.loc["total"] = result.loc[1] + result.loc[2] + result.loc[3]
result

Survived    0    1  total
Pclass
1          80  136    216
2          97   87    184
3         372  119    491
total     549  342    891

In [107]:
df1= pd.read_csv("datas/2014_p.csv",encoding="euc_kr")
df1.tail(2)
#레이스 데이터

,ID,RCTRCK,RACE_DE,RACE_NO,PARTCPT_NO,RANK,RCHOSE_NM,HRSMN,RCORD,ARVL_DFFRNC,EACH_SCTN_PASAGE_RANK,A_WIN_SYTM_EXPECT_ALOT,WIN_STA_EXPECT_ALOT
27216,27217,제주,2014-11-29,9,7,6.0,미주여행,김경휴,0:01:31.1,13,2 - - - 2 - 3 - 6,6.2,9.4
27217,27218,제주,2014-11-29,9,6,1.0,철옹성,장우성,0:01:26.6,NaN,1 - - - 1 - 1 - 1,3.9,2.9

In [106]:
df2= pd.read_csv("datas/2014_S.csv",encoding="euc_kr")
df2.tail(2)
# 말 데이터

,ID,RCTRCK,RACE_DE,PRDCTN_NATION_NM,SEX,AGE,BND_WT,TRNER,RCHOSE_OWNR_NM,RCHOSE_BDWGH
27216,27217,제주,2014-11-29,한,거,NaN,53.0,강대은,김기준,281
27217,27218,제주,2014-11-29,한,거,NaN,57.5,박병진,강상우,314

In [108]:
# 위 두데이터를 조합하여 어떤 성별이 1등을 많이했는지,
#1,2,3 등에대하여 3,2,1점을 주어 어떤말이 승점을 많이 얻었는지